tests/tests/requests/events_getservicecapabilities.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tev="http://www.onvif.org/ver10/events/wsdl">
   <soap:Header/>
   <soap:Body>
      <tev:GetServiceCapabilities/>
   </soap:Body>
</soap:Envelope>
