artifacts/events/create_body_2.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
            xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
            xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
            xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <s:Header/>
  <s:Body>
    <tev:CreatePullPointSubscription>
      <!-- Optional topic filter: insert expression below if needed -->
      
      <!-- No InitialTerminationTime to test server default (~10 minutes) -->
    </tev:CreatePullPointSubscription>
  </s:Body>
</s:Envelope>

