integration_testing/onvif/event_service/GetEventProperties.xml

<?xml version="1.0" encoding="utf-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
	<s:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>admin</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">fxtQgAL6Wu+P2ovC1ExHVfBQiik=</wsse:Password>
				<wsse:Nonce>ll2JQ7NMcEmMO17+DYm8Lg==</wsse:Nonce>
				<wsu:Created>2022-11-07T14:16:35Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</s:Header>
	<s:Body xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
		<GetEventProperties xmlns="http://www.onvif.org/ver10/events/wsdl"/>
	</s:Body>
</s:Envelope>