tests/PullPointSubscription_PullMessages.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" >
	<SOAP-ENV:Body>
		<PullMessages xmlns="http://www.onvif.org/ver10/events/wsdl" />
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
