ebook/09.12.03.md

# 9.12.3 CreatePullPointSubscription

客户端可以从TopicProperties订阅指定的通知信息。下面的XML示例显示了设备规则引擎订阅所产生的通知。客户端只对引用名为VideoAnalyticsConfiguration、值为"2"和名为VideoSourceConfiguration、值为"1"的通知起反应。此订阅有一分钟超时。如果订阅没有明确续订或者不定期拉取消息，那么它将在此时间后自动终止。

```
<?xml version="1.0" encoding="UTF-8"?>
	<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
			xmlns:wsa="http://www.w3.org/2005/08/addressing"
			xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
			xmlns:tet="http://www.onvif.org/ver10/events/wsdl"
			xmlns:tns1="http://www.onvif.org/ver10/topics">
	<SOAP-ENV:Header>
		<wsa:Action>
			http://www.onvif.org/ver10/events/wsdl/EventPortType/CreatePullPointSubscriptionRequest
		</wsa:Action>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<tet:CreatePullPointSubscription>
			<tet:Filter>
				<wsnt:TopicExpression Dialect="http://www.onvif.org/ver10/tev/topicExpression/ConcreteSet">
					tns1:RuleEngine//.
				</wsnt:TopicExpression>
				<wsnt:MessageContent Dialect="http://www.onvif.org/ver10/te v/messageContentFilter/ItemFilter">
					boolean(//tt:SimpleItem[@Name="VideoAnalyticsConfigurationToken" and @Value="2"]) and boolean(//tt:SimpleItem[@Name="VideoSourceConfigurationToken" and @Value="1"])
				</wsnt:MessageContent>
			</tet:Filter>
			<tet:InitialTerminationTime>
				PT1M
			</tet:InitialTerminationTime>
		</tet:CreatePullPointSubscription>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
```

[上一章](09.12.02.md)|[继续阅读](09.12.04.md)